MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC54101J512BD64/mcu.h
/*
** ###################################################################
**     Processors:          LPC54101J256BD64
**                          LPC54101J256UK49
**                          LPC54101J512BD64
**                          LPC54101J512UK49
**
**     Compilers:           IAR ANSI C/C++ Compiler for ARM
**                          Keil ARM C/C++ Compiler
**                          MCUXpresso Compiler
**
**     Reference manual:    LPC5410x User manual Rev. 2.4 25 May 2016
**     Version:             rev. 1.0, 2016-04-29
**     Build:               b190723
**
**     Abstract:
**         CMSIS Peripheral Access Layer for LPC54101
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2019 NXP
**     All rights reserved.
**
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2016-04-29)
**         Initial version.
**
** ###################################################################
*/

/*!
 * @file LPC54101.h
 * @version 1.0
 * @date 2016-04-29
 * @brief CMSIS Peripheral Access Layer for LPC54101
 *
 * CMSIS Peripheral Access Layer for LPC54101
 */

#ifndef _LPC54101_H_
#define _LPC54101_H_                             /**< Symbol preventing repeated inclusion */

/** Memory map major version (memory maps with equal major version number are
 * compatible) */
#define MCU_MEM_MAP_VERSION 0x0100U
/** Memory map minor version */
#define MCU_MEM_MAP_VERSION_MINOR 0x0000U


/* ----------------------------------------------------------------------------
   -- Interrupt vector numbers
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Interrupt_vector_numbers Interrupt vector numbers
 * @{
 */

/** Interrupt Number Definitions */
#define NUMBER_OF_INT_VECTORS 57                 /**< Number of interrupts in the Vector table */

typedef enum IRQn {
  /* Auxiliary constants */
  NotAvail_IRQn                = -128,             /**< Not available device specific interrupt */

  /* Core interrupts */
  NonMaskableInt_IRQn          = -14,              /**< Non Maskable Interrupt */
  HardFault_IRQn               = -13,              /**< Cortex-M4 SV Hard Fault Interrupt */
  MemoryManagement_IRQn        = -12,              /**< Cortex-M4 Memory Management Interrupt */
  BusFault_IRQn                = -11,              /**< Cortex-M4 Bus Fault Interrupt */
  UsageFault_IRQn              = -10,              /**< Cortex-M4 Usage Fault Interrupt */
  SVCall_IRQn                  = -5,               /**< Cortex-M4 SV Call Interrupt */
  DebugMonitor_IRQn            = -4,               /**< Cortex-M4 Debug Monitor Interrupt */
  PendSV_IRQn                  = -2,               /**< Cortex-M4 Pend SV Interrupt */
  SysTick_IRQn                 = -1,               /**< Cortex-M4 System Tick Interrupt */

  /* Device specific interrupts */
  WDT_IRQn                     = 0,                /**< Windowed watchdog timer, Brownout detect */
  BOD_IRQn                     = 1,                /**< BOD interrupt */
  Reserved18_IRQn              = 2,                /**< Reserved interrupt */
  DMA0_IRQn                    = 3,                /**< DMA controller */
  GINT0_IRQn                   = 4,                /**< GPIO group 0 */
  PIN_INT0_IRQn                = 5,                /**< Pin interrupt 0 or pattern match engine slice 0 */
  PIN_INT1_IRQn                = 6,                /**< Pin interrupt 1or pattern match engine slice 1 */
  PIN_INT2_IRQn                = 7,                /**< Pin interrupt 2 or pattern match engine slice 2 */
  PIN_INT3_IRQn                = 8,                /**< Pin interrupt 3 or pattern match engine slice 3 */
  UTICK0_IRQn                  = 9,                /**< Micro-tick Timer */
  MRT0_IRQn                    = 10,               /**< Multi-rate timer */
  CTIMER0_IRQn                 = 11,               /**< Standard counter/timer CTIMER0 */
  CTIMER1_IRQn                 = 12,               /**< Standard counter/timer CTIMER1 */
  CTIMER2_IRQn                 = 13,               /**< Standard counter/timer CTIMER2 */
  CTIMER3_IRQn                 = 14,               /**< Standard counter/timer CTIMER3 */
  CTIMER4_IRQn                 = 15,               /**< Standard counter/timer CTIMER4 */
  SCT0_IRQn                    = 16,               /**< SCTimer/PWM */
  USART0_IRQn                  = 17,               /**< USART0 */
  USART1_IRQn                  = 18,               /**< USART1 */
  USART2_IRQn                  = 19,               /**< USART2 */
  USART3_IRQn                  = 20,               /**< USART3 */
  I2C0_IRQn                    = 21,               /**< I2C0 */
  I2C1_IRQn                    = 22,               /**< I2C1 */
  I2C2_IRQn                    = 23,               /**< I2C2 */
  SPI0_IRQn                    = 24,               /**< SPI0 */
  SPI1_IRQn                    = 25,               /**< SPI1 */
  ADC0_SEQA_IRQn               = 26,               /**< ADC0 sequence A completion. */
  ADC0_SEQB_IRQn               = 27,               /**< ADC0 sequence B completion. */
  ADC0_THCMP_IRQn              = 28,               /**< ADC0 threshold compare and error. */
  RTC_IRQn                     = 29,               /**< RTC alarm and wake-up interrupts */
  Reserved46_IRQn              = 30,               /**< Reserved interrupt */
  MAILBOX_IRQn                 = 31,               /**< Mailbox interrupt (present on selected devices) */
  GINT1_IRQn                   = 32,               /**< GPIO group 1 */
  PIN_INT4_IRQn                = 33,               /**< Pin interrupt 4 or pattern match engine slice 4 int */
  PIN_INT5_IRQn                = 34,               /**< Pin interrupt 5 or pattern match engine slice 5 int */
  PIN_INT6_IRQn                = 35,               /**< Pin interrupt 6 or pattern match engine slice 6 int */
  PIN_INT7_IRQn                = 36,               /**< Pin interrupt 7 or pattern match engine slice 7 int */
  Reserved53_IRQn              = 37,               /**< Reserved interrupt */
  Reserved54_IRQn              = 38,               /**< Reserved interrupt */
  Reserved55_IRQn              = 39,               /**< Reserved interrupt */
  RIT_IRQn                     = 40                /**< Repetitive Interrupt Timer */
} IRQn_Type;

/*!
 * @}
 */ /* end of group Interrupt_vector_numbers */


/* ----------------------------------------------------------------------------
   -- Cortex M4 Core Configuration
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Cortex_Core_Configuration Cortex M4 Core Configuration
 * @{
 */

