MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC54101J512BD64/mcu.h
/*! @name TXCTL - SPI Transmit Control */
/*! @{ */
#define SPI_TXCTL_TXSSEL0_N_MASK                 (0x10000U)
#define SPI_TXCTL_TXSSEL0_N_SHIFT                (16U)
#define SPI_TXCTL_TXSSEL0_N(x)                   (((uint32_t)(((uint32_t)(x)) << SPI_TXCTL_TXSSEL0_N_SHIFT)) & SPI_TXCTL_TXSSEL0_N_MASK)
#define SPI_TXCTL_TXSSEL1_N_MASK                 (0x20000U)
#define SPI_TXCTL_TXSSEL1_N_SHIFT                (17U)
#define SPI_TXCTL_TXSSEL1_N(x)                   (((uint32_t)(((uint32_t)(x)) << SPI_TXCTL_TXSSEL1_N_SHIFT)) & SPI_TXCTL_TXSSEL1_N_MASK)
#define SPI_TXCTL_TXSSEL2_N_MASK                 (0x40000U)
#define SPI_TXCTL_TXSSEL2_N_SHIFT                (18U)
#define SPI_TXCTL_TXSSEL2_N(x)                   (((uint32_t)(((uint32_t)(x)) << SPI_TXCTL_TXSSEL2_N_SHIFT)) & SPI_TXCTL_TXSSEL2_N_MASK)
#define SPI_TXCTL_TXSSEL3_n_MASK                 (0x80000U)
#define SPI_TXCTL_TXSSEL3_n_SHIFT                (19U)
#define SPI_TXCTL_TXSSEL3_n(x)                   (((uint32_t)(((uint32_t)(x)) << SPI_TXCTL_TXSSEL3_n_SHIFT)) & SPI_TXCTL_TXSSEL3_n_MASK)
#define SPI_TXCTL_EOT_MASK                       (0x100000U)
#define SPI_TXCTL_EOT_SHIFT                      (20U)
#define SPI_TXCTL_EOT(x)                         (((uint32_t)(((uint32_t)(x)) << SPI_TXCTL_EOT_SHIFT)) & SPI_TXCTL_EOT_MASK)
#define SPI_TXCTL_EOF_MASK                       (0x200000U)
#define SPI_TXCTL_EOF_SHIFT                      (21U)
#define SPI_TXCTL_EOF(x)                         (((uint32_t)(((uint32_t)(x)) << SPI_TXCTL_EOF_SHIFT)) & SPI_TXCTL_EOF_MASK)
#define SPI_TXCTL_RXIGNORE_MASK                  (0x400000U)
#define SPI_TXCTL_RXIGNORE_SHIFT                 (22U)
#define SPI_TXCTL_RXIGNORE(x)                    (((uint32_t)(((uint32_t)(x)) << SPI_TXCTL_RXIGNORE_SHIFT)) & SPI_TXCTL_RXIGNORE_MASK)
#define SPI_TXCTL_LEN_MASK                       (0xF000000U)
#define SPI_TXCTL_LEN_SHIFT                      (24U)
#define SPI_TXCTL_LEN(x)                         (((uint32_t)(((uint32_t)(x)) << SPI_TXCTL_LEN_SHIFT)) & SPI_TXCTL_LEN_MASK)
/*! @} */

/*! @name DIV - SPI clock Divider */
/*! @{ */
#define SPI_DIV_DIVVAL_MASK                      (0xFFFFU)
#define SPI_DIV_DIVVAL_SHIFT                     (0U)
#define SPI_DIV_DIVVAL(x)                        (((uint32_t)(((uint32_t)(x)) << SPI_DIV_DIVVAL_SHIFT)) & SPI_DIV_DIVVAL_MASK)
/*! @} */

/*! @name INTSTAT - SPI Interrupt Status */
/*! @{ */
#define SPI_INTSTAT_RXRDY_MASK                   (0x1U)
#define SPI_INTSTAT_RXRDY_SHIFT                  (0U)
#define SPI_INTSTAT_RXRDY(x)                     (((uint32_t)(((uint32_t)(x)) << SPI_INTSTAT_RXRDY_SHIFT)) & SPI_INTSTAT_RXRDY_MASK)
#define SPI_INTSTAT_TXRDY_MASK                   (0x2U)
#define SPI_INTSTAT_TXRDY_SHIFT                  (1U)
#define SPI_INTSTAT_TXRDY(x)                     (((uint32_t)(((uint32_t)(x)) << SPI_INTSTAT_TXRDY_SHIFT)) & SPI_INTSTAT_TXRDY_MASK)
#define SPI_INTSTAT_RXOV_MASK                    (0x4U)
#define SPI_INTSTAT_RXOV_SHIFT                   (2U)
#define SPI_INTSTAT_RXOV(x)                      (((uint32_t)(((uint32_t)(x)) << SPI_INTSTAT_RXOV_SHIFT)) & SPI_INTSTAT_RXOV_MASK)
#define SPI_INTSTAT_TXUR_MASK                    (0x8U)
#define SPI_INTSTAT_TXUR_SHIFT                   (3U)
#define SPI_INTSTAT_TXUR(x)                      (((uint32_t)(((uint32_t)(x)) << SPI_INTSTAT_TXUR_SHIFT)) & SPI_INTSTAT_TXUR_MASK)
#define SPI_INTSTAT_SSA_MASK                     (0x10U)
#define SPI_INTSTAT_SSA_SHIFT                    (4U)
#define SPI_INTSTAT_SSA(x)                       (((uint32_t)(((uint32_t)(x)) << SPI_INTSTAT_SSA_SHIFT)) & SPI_INTSTAT_SSA_MASK)
#define SPI_INTSTAT_SSD_MASK                     (0x20U)
#define SPI_INTSTAT_SSD_SHIFT                    (5U)
#define SPI_INTSTAT_SSD(x)                       (((uint32_t)(((uint32_t)(x)) << SPI_INTSTAT_SSD_SHIFT)) & SPI_INTSTAT_SSD_MASK)
#define SPI_INTSTAT_MSTIDLE_MASK                 (0x100U)
#define SPI_INTSTAT_MSTIDLE_SHIFT                (8U)
#define SPI_INTSTAT_MSTIDLE(x)                   (((uint32_t)(((uint32_t)(x)) << SPI_INTSTAT_MSTIDLE_SHIFT)) & SPI_INTSTAT_MSTIDLE_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group SPI_Register_Masks */


/* SPI - Peripheral instance base addresses */
/** Peripheral SPI0 base address */
#define SPI0_BASE                                (0x400A4000u)
/** Peripheral SPI0 base pointer */
#define SPI0                                     ((SPI_Type *)SPI0_BASE)
/** Peripheral SPI1 base address */
#define SPI1_BASE                                (0x400A8000u)
/** Peripheral SPI1 base pointer */
#define SPI1                                     ((SPI_Type *)SPI1_BASE)
/** Array initializer of SPI peripheral base addresses */
#define SPI_BASE_ADDRS                           { SPI0_BASE, SPI1_BASE }
/** Array initializer of SPI peripheral base pointers */
#define SPI_BASE_PTRS                            { SPI0, SPI1 }
/** Interrupt vectors for the SPI peripheral type */
#define SPI_IRQS                                 { SPI0_IRQn, SPI1_IRQn }

/*!
 * @}
 */ /* end of group SPI_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- SYSCON Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SYSCON_Peripheral_Access_Layer SYSCON Peripheral Access Layer
 * @{
 */

/** SYSCON - Register Layout Typedef */
typedef struct {
  __IO uint32_t SYSMEMREMAP;                       /**< System memory remap, offset: 0x0 */
  __IO uint32_t AHBMATPRIO;                        /**< AHB multilayer matrix priority control, offset: 0x4 */
       uint8_t RESERVED_0[12];
  __IO uint32_t SYSTCKCAL;                         /**< System tick counter calibration, offset: 0x14 */
       uint8_t RESERVED_1[4];
  __IO uint32_t NMISRC;                            /**< NMI Source Select, offset: 0x1C */
  __IO uint32_t ASYNCAPBCTRL;                      /**< Asynchronous APB Control, offset: 0x20 */
       uint8_t RESERVED_2[28];
  __IO uint32_t SYSRSTSTAT;                        /**< System reset status register, offset: 0x40 */
  __IO uint32_t PRESETCTRL[2];                     /**< Peripheral reset control n, array offset: 0x44, array step: 0x4 */
  __IO uint32_t PRESETCTRLSET[2];                  /**< Set bits in PRESETCTRL n, array offset: 0x4C, array step: 0x4 */
  __IO uint32_t PRESETCTRLCLR[2];                  /**< Clear bits in PRESETCTRL n, array offset: 0x54, array step: 0x4 */
  __IO uint32_t PIOPORCAP0;                        /**< POR captured PIO status 0, offset: 0x5C */
  __IO uint32_t PIOPORCAP1;                        /**< POR captured PIO status 1, offset: 0x60 */
       uint8_t RESERVED_3[4];
  __IO uint32_t PIORESCAP0;                        /**< Reset captured PIO status 0, offset: 0x68 */
  __IO uint32_t PIORESCAP1;                        /**< Reset captured PIO status 1, offset: 0x6C */
       uint8_t RESERVED_4[16];
  __IO uint32_t MAINCLKSELA;                       /**< Main clock source select A, offset: 0x80 */
  __IO uint32_t MAINCLKSELB;                       /**< Main clock source select B, offset: 0x84 */
       uint8_t RESERVED_5[4];
  __IO uint32_t ADCCLKSEL;                         /**< ADC clock source select, offset: 0x8C */
       uint8_t RESERVED_6[4];
  __IO uint32_t CLKOUTSELA;                        /**< CLKOUT clock source select A, offset: 0x94 */
  __IO uint32_t CLKOUTSELB;                        /**< CLKOUT clock source select B, offset: 0x98 */
       uint8_t RESERVED_7[4];
  __IO uint32_t SYSPLLCLKSEL;                      /**< PLL clock source select, offset: 0xA0 */
       uint8_t RESERVED_8[28];
  __IO uint32_t AHBCLKCTRL[2];                     /**< AHB Clock control n, array offset: 0xC0, array step: 0x4 */
  __IO uint32_t AHBCLKCTRLSET[2];                  /**< Set bits in AHBCLKCTRL n, array offset: 0xC8, array step: 0x4 */
  __IO uint32_t AHBCLKCTRLCLR[2];                  /**< Clear bits in AHBCLKCTRL n, array offset: 0xD0, array step: 0x4 */
       uint8_t RESERVED_9[8];
  __IO uint32_t SYSTICKCLKDIV;                     /**< SYSTICK clock divider, offset: 0xE0 */
  __IO uint32_t TRACECLKDIV;                       /**< TRACE clock divider, offset: 0xE4 */
       uint8_t RESERVED_10[24];
  __IO uint32_t AHBCLKDIV;                         /**< System clock divider, offset: 0x100 */
       uint8_t RESERVED_11[4];
  __IO uint32_t ADCCLKDIV;                         /**< ADC clock divider, offset: 0x108 */
  __IO uint32_t CLKOUTDIV;                         /**< CLKOUT clock divider, offset: 0x10C */
       uint8_t RESERVED_12[16];
  __IO uint32_t FREQMECTRL;                        /**< Frequency measure register, offset: 0x120 */
  __IO uint32_t FLASHCFG;                          /**< Flash wait states configuration, offset: 0x124 */
       uint8_t RESERVED_13[32];
  __IO uint32_t FIFOCTRL;                          /**< Serial interface FIFO enables, offset: 0x148 */
       uint8_t RESERVED_14[56];
  __IO uint32_t IRCCTRL;                           /**< IRC oscillator control, offset: 0x184 */
       uint8_t RESERVED_15[8];
  __IO uint32_t RTCOSCCTRL;                        /**< RTC oscillator 32 kHz output control, offset: 0x190 */
       uint8_t RESERVED_16[28];
  __IO uint32_t SYSPLLCTRL;                        /**< PLL control, offset: 0x1B0 */
  __IO uint32_t SYSPLLSTAT;                        /**< PLL status, offset: 0x1B4 */
  __IO uint32_t SYSPLLNDEC;                        /**< PLL N decoder, offset: 0x1B8 */
  __IO uint32_t SYSPLLPDEC;                        /**< PLL P decoder, offset: 0x1BC */
  __IO uint32_t SYSPLLSSCTRL0;                     /**< PLL spread spectrum control 0, offset: 0x1C0 */
  __IO uint32_t SYSPLLSSCTRL1;                     /**< PLL spread spectrum control 1, offset: 0x1C4 */
       uint8_t RESERVED_17[72];
  __IO uint32_t PDRUNCFG;                          /**< Power configuration register, offset: 0x210 */
  __IO uint32_t PDRUNCFGSET;                       /**< Set bits in PDRUNCFG, offset: 0x214 */
  __IO uint32_t PDRUNCFGCLR;                       /**< Clear bits in PDRUNCFG, offset: 0x218 */
       uint8_t RESERVED_18[36];
  __IO uint32_t STARTER[2];                        /**< Start logic n wake-up enable register, array offset: 0x240, array step: 0x4 */
  __IO uint32_t STARTERSET[2];                     /**< Set bits in STARTERP n, array offset: 0x248, array step: 0x4 */
  __IO uint32_t STARTERCLR[2];                     /**< Clear bits in STARTER n, array offset: 0x250, array step: 0x4 */
       uint8_t RESERVED_19[168];
  __IO uint32_t CPUCTRL;                           /**< CPU Control for multiple processors, offset: 0x300 */
  __IO uint32_t CPBOOT;                            /**< Coprocessor Boot Address, offset: 0x304 */
  __IO uint32_t CPSTACK;                           /**< Coprocessor Stack Address, offset: 0x308 */
  __IO uint32_t CPSTAT;                            /**< Coprocessor Status, offset: 0x30C */
       uint8_t RESERVED_20[228];
  __IO uint32_t JTAGIDCODE;                        /**< JTAG ID code register, offset: 0x3F4 */
  __IO uint32_t DEVICE_ID[2];                      /**< Part ID register, array offset: 0x3F8, array step: 0x4 */
       uint8_t RESERVED_21[179268];
  __IO uint32_t BODCTRL;                           /**< Brown-Out Detect control, offset: 0x2C044 */
} SYSCON_Type;

/* ----------------------------------------------------------------------------
   -- SYSCON Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SYSCON_Register_Masks SYSCON Register Masks
 * @{
 */

/*! @name SYSMEMREMAP - System memory remap */
/*! @{ */
#define SYSCON_SYSMEMREMAP_MAP_MASK              (0x3U)
#define SYSCON_SYSMEMREMAP_MAP_SHIFT             (0U)
/*! MAP - System memory remap. Value 0x3 is reserved.
 *  0b00..Boot Loader Mode. Interrupt vectors are re-mapped to Boot ROM.
 *  0b01..User RAM Mode. Interrupt vectors are re-mapped to Static RAM.
 *  0b10..User Flash Mode. Interrupt vectors are not re-mapped and reside in Flash.
 */
#define SYSCON_SYSMEMREMAP_MAP(x)                (((uint32_t)(((uint32_t)(x)) << SYSCON_SYSMEMREMAP_MAP_SHIFT)) & SYSCON_SYSMEMREMAP_MAP_MASK)
/*! @} */

